toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
// MARK: - Power

static bool _SDSetPowerEnabled(bool en) {
    #warning TODO: short-circuit if the pin state isn't changing, to save time
    
    _Pin::VDD_B_SD_EN::Write(en);
    // The TPS22919 takes 1ms for VDD to reach 2.8V (empirically measured)
    _Scheduler::Sleep(_Scheduler::Ms(2));
    return true;
}

static bool _ImgSetPowerEnabled(bool en) {
    #warning TODO: short-circuit if the pin state isn't changing, to save time
    
    if (en) {
        _Pin::VDD_2V8_IMG_EN::Write(1);
        _Scheduler::Sleep(_Scheduler::Us(100)); // 100us delay needed between power on of VAA (2V8) and VDD_IO (1V8)
        _Pin::VDD_1V8_IMG_EN::Write(1);
        
        #warning measure actual delay that we need for the rails to rise
    
    } else {
        // No delay between 2V8/1V8 needed for power down (per AR0330CS datasheet)
        _Pin::VDD_1V8_IMG_EN::Write(0);
        _Pin::VDD_2V8_IMG_EN::Write(0);
        
        #warning measure actual delay that we need for the rails to fall
    }
    return true;
}

// MARK: - IntState

inline bool Toastbox::IntState::InterruptsEnabled() {
    return __get_SR_register() & GIE;
}

inline void Toastbox::IntState::SetInterruptsEnabled(bool en) {
    if (en) __bis_SR_register(GIE);
    else    __bic_SR_register(GIE);
}

static void _Sleep() {
    // Put ourself to sleep until an interrupt occurs. This function may or may not return:
    // 
    // - This function returns if an interrupt was already pending and the ISR
    //   wakes us (via `__bic_SR_register_on_exit`). In this case we never enter LPM3.5.
    // 
    // - This function doesn't return if an interrupt wasn't pending and
    //   therefore we enter LPM3.5. The next time we wake will be due to a
    //   reset and execution will start from main().
    
    // If we're currently busy (_BusyCount > 0), enter LPM1 sleep because some tasks are running.
    // If we're not busy (!_BusyCount), enter the deep LPM3.5 sleep, where RAM content is lost.
//    const uint16_t LPMBits = (_BusyCount ? LPM1_bits : LPM3_bits);
    const uint16_t LPMBits = LPM1_bits;
    
    // If we're entering LPM3, disable regulator so we enter LPM3.5 (instead of just LPM3)
    if (LPMBits == LPM3_bits) {
        PMMCTL0_H = PMMPW_H; // Open PMM Registers for write
        PMMCTL0_L |= PMMREGOFF_1_L;
    }
    
    // Atomically enable interrupts and go to sleep
    const bool prevEn = Toastbox::IntState::InterruptsEnabled();
    __bis_SR_register(GIE | LPMBits);
    // If interrupts were disabled previously, disable them again
    if (!prevEn) Toastbox::IntState::SetInterruptsEnabled(false);
}

// MARK: - Tasks

//static void debugSignal() {
//    _Pin::DEBUG_OUT::Init();
//    for (int i=0; i<10; i++) {
//        _Pin::DEBUG_OUT::Write(0);
//        for (volatile int i=0; i<10000; i++);
//        _Pin::DEBUG_OUT::Write(1);
//        for (volatile int i=0; i<10000; i++);
//    }
//}

//class _BusyTimeoutTask {
//public:
//    static void Run() {
//        for (;;) {
////            _Scheduler::Wait<_BusyTimeoutTask>([] { return _Busy.has_value(); });
//            
//            while (_Scheduler::Wait<_BusyTimeoutTask,1000>([] { return (bool)_Busy; })) {
//                _Busy = std::nullopt;
//            }
//            
//            // Asynchronously turn off the image sensor / SD card
//            _Img::DisableAsync();
//            _SD::DisableAsync();
//            
//            // Wait until the image sensor / SD card are off
//            _Img::Wait();
//            _SD::Wait();
//            
////            // Wait to be tickled
////            _Scheduler::Wait<_BusyTimeoutTask>([] { return _Tickled; });
////
////            // Assert that we're busy until we stop getting tickled + 1s
////            _BusyAssertion busy;
////            do {
////                _Tickled = false;
////            } while ();
////
////            // Asynchronously turn off the image sensor / SD card
////            _Img::DisableAsync();
////            _SD::DisableAsync();
////
////            // Wait until the image sensor / SD card are off
////            _Img::Wait();
////            _SD::Wait();
//        }
//        
//        _Scheduler::Yield();
//    }
//    
//    
////    static void Run() {
////        for (;;) {
////            _BusyAssertion busy;
////            while (_Scheduler::Wait<_BusyTimeoutTask,1000>([] { return _Tickled; })) {
////                _Tickled = false;
////            }
////            
////            // Asynchronously turn off the image sensor / SD card
////            _Img::DisableAsync();
////            _SD::DisableAsync();
////            
////            // Wait until the image sensor / SD card are off
////            _Img::Wait();
////            _SD::Wait();
////            
//////            // Wait to be tickled
//////            _Scheduler::Wait<_BusyTimeoutTask>([] { return _Tickled; });
//////
//////            // Assert that we're busy until we stop getting tickled + 1s
//////            _BusyAssertion busy;
//////            do {
//////                _Tickled = false;
//////            } while ();
//////
//////            // Asynchronously turn off the image sensor / SD card
//////            _Img::DisableAsync();
//////            _SD::DisableAsync();
//////
//////            // Wait until the image sensor / SD card are off
//////            _Img::Wait();
//////            _SD::Wait();
////        }
////        
////        _Scheduler::Yield();
////    }
//    
////    static void Stop() {
////        _Scheduler::Stop<_BusyTimeoutTask>();
////    }
//    
//    static void Tickle() {
//        _Busy.emplace();
//    }
//    
//    // Task options
//    static constexpr Toastbox::TaskOptions Options{};
//    
//    // Task stack
//    [[gnu::section(".stack._BusyTimeoutTask")]]
//    static inline uint8_t Stack[128];
//    
//private:
//    static inline std::optional<_BusyAssertion> _Busy;
//};

struct _MotionTask {
    static void Run() {
        for (;;) {
            _Pin::DEBUG_OUT::Write(0);
            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
            _Scheduler::Sleep(_Scheduler::Ms(500));
            
